-> Добавить другое применение денег

-> Можно добавить накопление ярости, чтобы можно было вызвать демона

-> Можно добавить выбор стиля игры

-> Можно добавить смену граф объекта у воина при атаке

-> Можно добавить замедление времени с помощью Main.game.basicTime

-> Разные виды земли как в героях

-> Вид замка в зависимости от земли

-> Добавить осаду замка

-> Ввести статистику убийств и другую статистику, например количество убитых воином солдат

-> Из гейм настроек
	-> Добавить выбор карты(из редактора, случайная много леса, случайная много воды, просто случайная и др.)
	-> Выбор начального колва воинов
	-> Выбор колво ресурсов
	-> Возможно выбор типа цели для победы
	
-> Если добавишь музыку подели её на множество кусочков а потом в случайном порядке её вставляй

-> SWF профайлкр проверь

-> Доделать статистику




		***Заоблачные цели***

-> Добавить рабочих, если разработаешь нормальный план, чтобы ничего переделывать не пришлось

-> Добавить ресурсы и их значение в игре

-> Создать какую-либо необычную цель игры:
										- контролировать крепость в течении ходов
										- украсть из замка грааль
										- захватить все контрольные точки

-> И если уж совсем ты so mad то сделай выбор режимов игры